{"keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"trainable": true, "batch_input_shape": [null, 64, 64, 3], "name": "lambda_1", "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00dd\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "layer1_conv2d", "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "nb_filter": 3, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "layer2_conv2d", "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "bias": true, "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "nb_filter": 24, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "layer3_conv2d", "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "nb_filter": 36, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "layer4_conv2d", "b_regularizer": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "nb_filter": 48, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "name": "layer5_conv2d", "b_regularizer": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "init": "glorot_uniform", "bias": true, "subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "nb_filter": 64, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "elu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "output_dim": 100, "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 1600, "activation": "linear", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "output_dim": 50, "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 100, "activation": "linear", "b_constraint": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "elu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "output_dim": 10, "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 50, "activation": "linear", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 10, "activation": "linear", "b_constraint": null, "W_constraint": null}}], "class_name": "Sequential"}